UI_BOXES = {
    "登录界面更新提醒": (0.15, 0.25, 0.85, 0.75),
    "登录界面更新提醒确认按钮": (0.45, 0.55, 0.80, 0.78),

    "背包声骸数量": (0.087, 0.035, 0.183, 0.091),
    "背包声骸数量上限提示": (0.16, 0.24, 0.84, 0.78),
    "背包声骸数量上限取消按钮": (0.16, 0.24, 0.84, 0.78),
    
    "ESC菜单数据坞": (0.698, 0.388, 0.794, 0.582),
    "数据坞左上角判断": (0.0, 0.0, 0.15, 0.12),
    "数据坞标准融合入口": (0.225, 0.113, 0.348, 0.166),
    "数据坞开始标准融合": (0.422, 0.885, 0.637, 0.938),
    "数据坞标准融合全选": (0.239, 0.896, 0.297, 0.943),
    "数据坞数据融合次数": (0.677, 0.841, 0.895, 0.885),
    "数据坞标准融合按钮": (0.658, 0.880, 0.916, 0.946),
    "数据坞标准融合确认按钮": (0.59, 0.59, 0.75, 0.66),
    "数据坞标准融合获得声骸": (0.403, 0.0, 0.592, 0.352)
}

def get_ui_box(name):
    coords = UI_BOXES.get(name)
    if coords is None:
        raise KeyError(f"Unknown UI box: {name}")
    return coords
